artillery.yml
config:
  target: 'http://localhost:3001/rsvp'
  phases:
    - duration: 2
      arrivalRate: 1
  # variables:
  #   eventIds:
  #     - ['10199666']
  #     # - ['999988', '999990', '999989']
  #     # - ['899991 ', '899992', '899993']
  #     # - ['799991 ', '799992', '799993']
  defaults:
    headers:
      x-my-service-auth:
scenarios:
  - flow:
      # - loop:
      - get:
          # url: '/attendees/{{ $loopElement }}'
          url: '/attendees/977777'
      # over:
      #   eventIds
      # capture:
      # capturing response using reg expression
      #       - regexp: '[^]*'
      #         as: 'response'
      #  - log: 'response= {{response}}'